share.txt

can ignore this xml updates
<sapi:LicenceKey>6simstgstkqqjf7fqftlshnfpsjqvfji</sapi:LicenceKey>
<!--Optional:-->
<sapi:LoginID>BOM81308</sapi:LoginID><sapi:Version>1.9</sapi:Version>

end point
http://netconnect.bluedart.com/Ver1.9/Demo/ShippingAPI/Finder/ServiceFinderQuery.svc

wsdl file
https://netconnect.bluedart.com/Ver1.10/ShippingAPI/Finder/ServiceFinderQuery.svc?wsdl

headers
POST http://netconnect.bluedart.com/Ver1.9/Demo/ShippingAPI/Finder/ServiceFinderQuery.svc HTTP/1.1
Accept-Encoding: gzip,deflate
Content-Type: application/soap+xml;charset=UTF-8;action="http://tempuri.org/IServiceFinderQuery/GetServicesforPincode"
Content-Length: 1227
Host: netconnect.bluedart.com
Connection: Keep-Alive
User-Agent: Apache-HttpClient/4.5.5 (Java/16.0.1)

example help 
https://github.com/officer-rosmarino/node-soap-example

changes working w3school
const url = 'https://www.w3schools.com/xml/tempconvert.asmx';
        const sampleHeaders = {
            'Content-Type': 'text/xml',
        };

<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <FahrenheitToCelsius xmlns="https://www.w3schools.com/xml/">
      <Fahrenheit>75</Fahrenheit>
    </FahrenheitToCelsius>
  </soap12:Body>
</soap12:Envelope>

-------------
https://social.msdn.microsoft.com/Forums/vstudio/en-US/ed32328d-e3ad-47dd-bcb0-3db9e6205f9c/actionmismatchaddressingexception?forum=wcf
